[PR_Shredder X2SoldierClassTemplate]
+DisplayName="粉碎者"
+ClassSummary="破碎者，以其在近战中的精湛技艺而闻名，他们运用一种致命的组合：霰弹枪、剑和释放毁灭性酸性攻击的独特能力。凭借他们的武器库，他们可以轻松地消灭重甲对手，迅速拉近距离，并以腐蚀性的精确攻击穿透对方防御。"
+LeftAbilityTreeTitle="酸性"
+RightAbilityTreeTitle="刀剑"
AbilityTreeTitles[0]="花式射击"
AbilityTreeTitles[1]="突击"
AbilityTreeTitles[2]="刀剑大师"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

+RandomNickNames[0]="Shredder"
+RandomNickNames[1]="Ooze"
+RandomNickNames[2]="Slime"
+RandomNickNames[3]="Blademaster"
+RandomNickNames[4]="Decay"
+RandomNickNames[5]="The End"